cmap = [1 1 1; ...
    0 0 0; ...
    1 0 0; ...
    0 0 1; ...    
    0 1 0; ...
    1 1 0; ...
    0.9 0.9 0.9;  %路径1
    0.8 0.8 0.8;  %路径2
    0.7 0.7 0.7;  %路径3
    0.6 0.6 0.6;  %路径4
    0.5 0.5 0.5;  %路径5
    0.4 0.4 0.4;  %路径6
    0.3 0.3 0.3; %路径7
    0.2 0.2 0.2;  %路径8
    0.1 0.1 0.1;   %路径9
    0.05 0.05 0.05; %路径10
    1 0.75 0.8;      %机器人1
    0.86 0.08 0.24;      %机器人2
    0.5 0 0.5;      %机器人3
    0.25 0.4 0.86;      %机器人4
    0.44 0.5 0.56;      %机器人5
    0 1 1;      %机器人6
    1 0.84 0;      %机器人7
    1 0.55 0;      %机器人8
    0.74 0.56 0.56;      %机器人9
    0.12 0.56 1];     %机器人10
colormap(cmap);

map = false(18);
map(1:3, 1:3) = true;
map(1:4, 4:7) = true;
map(1:4, 9:10) =true;
map(1:18, 15:18) =true;
%map(1:7, 12:14) =true;
map(4:5, 1:2) = true;
map(18, 1:18) = true;
map(16:17, 1:2) = true;
map(16:17, 4:5) = true;
map(16:17, 7:10) = true;
map( 7:8, 12:14) =true;
map( 10:18, 12:14) =true;
map(10, 12) = false;
map(14, 12) = false;
map(7:8, 2:3) = true;
map(10:11, 2:3) = true;
map(13:14, 2:3) = true;
map(7:8, 5:6) = true;
map(10:11,5:6) = true;
map(13:14, 5:6) = true;
map(7:8, 8:9) = true;
map(10:11,8:9) = true;
map(13:14, 8:9) = true;
image(1.5, 1.5, map);
grid on;
axis image;
disp(map)